tools/cfd/template/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  OpenFOAM v2512 (opencfd/openfoam-default). Template: tools/cfd/make_case.py fills the @@-placeholders.
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
scale 1;

vertices
(
    (@@XMIN@@ @@YMIN@@ @@ZMIN@@)
    (@@XMAX@@ @@YMIN@@ @@ZMIN@@)
    (@@XMAX@@ @@YMAX@@ @@ZMIN@@)
    (@@XMIN@@ @@YMAX@@ @@ZMIN@@)
    (@@XMIN@@ @@YMIN@@ @@ZMAX@@)
    (@@XMAX@@ @@YMIN@@ @@ZMAX@@)
    (@@XMAX@@ @@YMAX@@ @@ZMAX@@)
    (@@XMIN@@ @@YMAX@@ @@ZMAX@@)
);

blocks ( hex (0 1 2 3 4 5 6 7) (@@NX@@ @@NY@@ @@NZ@@) simpleGrading (1 1 1) );

boundary
(
    background { type patch; faces ( (0 3 2 1) (4 5 6 7) (0 1 5 4) (1 2 6 5) (2 3 7 6) (3 0 4 7) ); }
);
