tools/cfd/template/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  OpenFOAM v2512 (opencfd/openfoam-default). Template: tools/cfd/make_case.py fills the @@-placeholders.
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
transportModel  Newtonian;
nu              @@NU@@;   // air, 1.2 kg/m3 (pressures are kinematic: p / 1.2)
