tools/cfd/template/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  OpenFOAM v2512 (opencfd/openfoam-default). Template: tools/cfd/make_case.py fills the @@-placeholders.
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);
boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    inlet    { type pressureInletOutletVelocity; value uniform (0 0 0); }
    ambient  { type pressureInletOutletVelocity; value uniform (0 0 0); }
    "(floor|board|impeller|mount|motor)" { type noSlip; }   // MRF turns the impeller's wall velocity
}
